/*자판기에서 초콜릿 바를 개당 $1에 살 수 있다고 가정하자.
모든 초콜릿 바 아네는 쿠폰이 들어 있다.
여러분은 자판기에서 7개의 쿠폰으로 1개의 초콜릿 바를 돌려받을 수 있다.
여러분은 n달러를 가지고 있을 때 쿠폰으로 돌려받은 초콜릿을 포함해서 몇 개의 초콜릿 바를 먹을 수 있을지 알고 싶다.
예를 들어 $20를 가지고 있다면 처음에는 20개의 초콜릿 바를 살 수 있다.
이 초콜릿 바에서 20개의 쿠폰을 얻을 수 있다.
14개의 쿠폰을 돌려주고 추가로 2개의 초콜릿 바를 받을 수 있다.
이 추가로 받은 2개의 초콜릿 바는 2개의 쿠폰을 더 준다.
따라서 여러분은 현재 8개의 쿠폰을 가지고 있다.
여러분은 마지막으로 1개의 초콜릿 바를 추가로 얻을 수 있다.
결국 23개의 초콜릿 바와 남은 2개의 쿠폰을 갖게 된다.
달러의 숫자를 입력하면 모든 돈과 사용 가능한 쿠폰을 사용한 쿠폰을 사용한 후에 몇 개의 초콜릿 바를 얻을 수 있는지 또한 남은 쿠폰의 개수를 출력하는 프로그램을 작성하라.
이 문제를 푸는 가장 쉬운 해결방법은 반복문을 이용하는 것이다.*/

#include <iostream>
using namespace std;

int main()
{

}