/*다음과 같은 신용 제도에 따라 여러분이 바로 $1,000의 스테레오 시스템을 구매한다면 계약금 없이 연 18%의 금리(연 평균 1.5%), 그리고 매달 $50의 금액을 지불해야 한다.
매달 $50를 내는 것은 이자로 사용되고, 그리고 남아 있는 빚의 일부를 변제하는 데 사용된다. 따라서 첫 달에는 $1,000에 대한 이자에서 1.5%를 낸다.
그 금액은 $15이다.
나머지 $35는 여러분의 빚에서 공제되고, 이것은 $965.00의 빚과 이어진다.
다음 달에는 $965.00의 1.5% 이자를 지불하고, 그 금액은 $14.48이다.
따라서 빚진 금액에서 $35.52($50 - $14.48)를 공제할 수 있다.
작성 프로그램은 대출금액을 상환하는 데 얼마나 걸리는지 그리고 이자 지불의 총금액뿐만 아니라 대출 기간도 알려 줄 것이다.
루프를 사용하여 이자의 금액과 매달 부채의 크기를 계산하라(여러분의 최종 프로그램은 월별 이자 지불 금액과 남아 있는 빚에 대한 출력은 필요 없다.
하지만 여러분은 값을 출력하지 않는 프로그램의 초기 버전을 쓸 수 있다.).
루프가 반복되는 횟수와 빚이 0이 될 때까지의 달의 수를 세기 위해 변수를 사용한다.
여러분은 다른 변수들도 사용하고 싶을 수 있다.
마지막 지불은 채무가 작다면 $50 미만일 것이다.
하지만 이자를 잊으면 안 된다.
$50를 빚지고 있는데 매달 $50에 대해 지불하는 것은 여러분의빚 청산에 거의 가까워지긴 할지라도 빚이 모두 갚아지는 것은 아니다.
$50에 대한 1개월 이자는 단지 75센트이다.*/

#include <iostream>
using namespace std;

int main()
{

}