/*이것이 몇 년에 걸쳐 에산을 만들기 어려웠던 이유는 가격이 안정되지 않았기 때문이다.
만약 여러분의 회사가 연간 200개의 연필이 필요한데, 지금부터 2년 동안 연필의 가격이 올해 가격과 같다면 여러분은 절대로 그것을 사용할 수 없다.
인플레이션 때문에 그것은 오늘보다 더 높아질 것이다.
특정 연도에 지정된 항목의 예상비용을 측정하는 프로그램을 작성하라.
이 프로그램은 물건의 비용, 지금으로부터 그 물건을 구매할 연간 수량과 인플레이션 비율을 물을 것이다.
이 프로그램은 지정된 기간 후의 물건의 에상비용을 출력한다.
사용자에게 인플레이션을 5.6(퍼센트)과 같이 퍼센트 비율로 입력받고, 프로그램은 0.056처럼 퍼센트를 백분율로 변환하여야 한다.
그리고 인플레이션에 따라 가격을 측정항여 조정할 수 있는 루프를 사용하여야 한다. (힌트 : 루프 사용.)*/

#include <iostream>
using namespace std;

int main()
{
	cout << "Enter the item's cost, "
}